Австралия/src/Reports/SummaryOfGeneratedDocuments/SummaryOfGeneratedDocuments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>SummaryOfGeneratedDocuments</name>
</mdclass:Report>

Австралия/src/InformationRegisters/Subscriptions/Subscriptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Subscriptions</name>
  <resources>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SubscriptionPlan</name>
    <type>
      <types>CatalogRef.SubscriptionPlans</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EmailTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/GeneratedDocumentsData/GeneratedDocumentsData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>GeneratedDocumentsData</name>
  <dimensions>
    <name>SubscriptionPlan</name>
    <type>
      <types>CatalogRef.SubscriptionPlans</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PlannedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ActualDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/Periodicity/Periodicity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Periodicity</name>
  <enumValues>
    <name>Day</name>
  </enumValues>
  <enumValues>
    <name>Week</name>
  </enumValues>
  <enumValues>
    <name>TenDays</name>
  </enumValues>
  <enumValues>
    <name>Month</name>
  </enumValues>
  <enumValues>
    <name>Quarter</name>
  </enumValues>
  <enumValues>
    <name>HalfYear</name>
  </enumValues>
  <enumValues>
    <name>Year</name>
  </enumValues>
  <enumValues>
    <name>Auto</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/Counterparties/Counterparties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Counterparties</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>RetailCustomer</name>
      <description>Retail customer</description>
    </items>
  </predefined>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.CounterpartiesAccessGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovePurchaseOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccountByDefault</name>
    <comment>Bank account by default</comment>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>BasicInformation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAcquisitionChannel</name>
    <type>
      <types>CatalogRef.CustomerAcquisitionChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractByDefault</name>
    <comment>Default counterparty contract</comment>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfBirth</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DefaultDeliveryOption</name>
    <type>
      <types>EnumRef.DeliveryOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectDebitMandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByContracts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EORI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Gender</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountCustomerSettlements</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountVendorSettlements</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyType</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <attributes>
    <name>LimitWithoutApproval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OtherRelationship</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OverdueLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTermsTemplate</name>
    <type>
      <types>CatalogRef.PaymentTermsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProvideEPD</name>
    <type>
      <types>EnumRef.VariantsOfProvidingEPD</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesRep</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTaxRate</name>
    <type>
      <types>CatalogRef.SalesTaxRates</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTerritory</name>
    <type>
      <types>CatalogRef.SalesTerritories</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Supplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackPaymentsByBills</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotShow</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesOfPayment</name>
    <attributes>
      <name>Term</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>BaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>DuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EarlyPaymentDiscounts</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Reports/SummaryOfGeneratedDocuments/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
	
#Region EventHandlers

Procedure OnComposeResult(ResultDocument, DetailsData, StandardProcessing)
	
	SetPrivilegedMode(True);
	
	StandardProcessing = False;
	Cancel = False;
	
	ReportSettings = SettingsComposer.GetSettings();
	
	TemplateComposer = New DataCompositionTemplateComposer;
	CompositionTemplate = TemplateComposer.Execute(DataCompositionSchema, ReportSettings, DetailsData);
	
	ExternalDataSets = GetExternalDataSets(ReportSettings, Cancel, ResultDocument);
	
	If Cancel Then
	
		Return;
	
	EndIf; 
	
	// Create and initialize a composition processor
	CompositionProcessor = New DataCompositionProcessor;
	CompositionProcessor.Initialize(CompositionTemplate, ExternalDataSets, DetailsData, True);
	
	// Create and initialize the result output processor
	OutputProcessor = New DataCompositionResultSpreadsheetDocumentOutputProcessor;
	OutputProcessor.SetDocument(ResultDocument);
	OutputProcessor.Output(CompositionProcessor);
	
EndProcedure

#EndRegion

#Region Private

Function GetExternalDataSets(ReportSettings, Cancel, ResultDocument)
	
	Result = New Structure;
	
	SubscriptionPlan = New ValueList;
	
	For Each Item In ReportSettings.DataParameters.Items Do
		
		If String(Item.Parameter) = "SubscriptionPlan" Then
			
			If ValueIsFilled(Item.Value) Then
				If TypeOf(Item.Value) = Type("ValueList") Then
					SubscriptionPlan = Item.Value;
				Else
					SubscriptionPlan.Add(Item.Value);
				EndIf;
			EndIf;
			
		EndIf;
		
		If String(Item.Parameter) = "Period" Then
			
			PeriodReport = Item.Value;
			
			StartDate = PeriodReport.StartDate;
			EndDate = PeriodReport.EndDate;
			
		EndIf;
		
	EndDo;
	
	If SubscriptionPlan.Count() = 0 Then
		
		If SettingsComposer.UserSettings.AdditionalProperties.VariantKey = "Supplier" Then
			
			Raise NStr("en = 'Cannot generate the report. Supplier schedules are not enabled.'; ru = 'Не удалось создать отчет. Графики поставщиков не включены.';pl = 'Nie można wygenerować raportu. Harmonogramy dostawców nie są włączone.';es_ES = 'No se puede generar el informe. Los horarios del proveedor no están activados.';es_CO = 'No se puede generar el informe. Los horarios del proveedor no están activados.';tr = 'Rapor oluşturulamıyor. Tedarikçi programları etkinleştirilmedi.';it = 'Impossibile generare il report. Non sono stati abilitati i programmi dei fornitori.';de = 'Der Bericht kann nicht generiert werden. Lieferantenzeitpläne sind nicht aktiviert.'");
			
			Return Result;
			
		Else 
			
			Raise NStr("en = 'Cannot generate the report. Subscription plans are not enabled.'; ru = 'Не удалось сформировать отчет. Тарифы подписки не включены.';pl = 'Nie można wygenerować raportu. Plany subskrypcji nie są włączone.';es_ES = 'No se puede generar el informe. Los planes de suscripción no están activados.';es_CO = 'No se puede generar el informe. Los planes de suscripción no están activados.';tr = 'Rapor oluşturulmadı. Abonelik planları etkinleştirilmedi.';it = 'Impossibile generare il report. Non sono stati abilitati i piani di abbonamento.';de = 'Der Bericht kann nicht generiert werden. Abonnementspläne sind nicht aktiviert.'");
			
			Return Result;
			
		EndIf;
		
	EndIf;
	
	If StartDate = Date(1, 1, 1) 
		And EndDate <> Date(1, 1, 1) Then
		
		Raise NStr("en = 'The period start date is required.'; ru = 'Требуется указать дату начала периода.';pl = 'Wymagana jest data rozpoczęcia okresu.';es_ES = 'Se requiere la fecha de inicio del período.';es_CO = 'Se requiere la fecha de inicio del período.';tr = 'Dönem başlangıç tarihi gerekli.';it = 'È richiesta la data di inizio del periodo.';de = 'Das Startdatum des Zeitraums ist erforderlich.'");
		
		Return Result;
		
	EndIf;
	
	ValueTableResult = New ValueTable;
	
	For Each ItemPlan In SubscriptionPlan Do
		
		ValueTableBySubscriptionPlan = GetValueTableBySubscriptionPlan(ItemPlan.Value, StartDate, EndDate);
		
		If ValueTableResult.Columns.Count() = 0 Then
			
			ValueTableResult = ValueTableBySubscriptionPlan.CopyColumns();
			
		EndIf;
		
		If ValueTableBySubscriptionPlan.Count() = 0 Then
			
			Continue;
			
		EndIf;
		
		For Each LineValueTable In ValueTableBySubscriptionPlan Do
			
			NewLineTableResult = ValueTableResult.Add();
			
			FillPropertyValues(NewLineTableResult, LineValueTable);
			
		EndDo;
		
	EndDo;
	
	Result.Insert("ValueTablePlannedDates", ValueTableResult);
	
	Return Result;
	
EndFunction

Function GetValueTableBySubscriptionPlan(SubscriptionPlan, Val StartDate, Val EndDate)
	
	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED
	|	Subscriptions.SubscriptionPlan AS SubscriptionPlan,
	|	MIN(Subscriptions.StartDate) AS StartDate
	|FROM
	|	InformationRegister.Subscriptions AS Subscriptions
	|WHERE
	|	Subscriptions.SubscriptionPlan = &SubscriptionPlan
	|
	|GROUP BY
	|	Subscriptions.SubscriptionPlan";
	
	Query.SetParameter("SubscriptionPlan", SubscriptionPlan);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		
		StartDate = Max(StartDate, SelectionDetailRecords.StartDate);
		
	EndDo;
	
	ValueTablePlannedDates = New ValueTable;
	ValueTablePlannedDates.Columns.Add("Counterparty", New TypeDescription("CatalogRef.Counterparties"));
	ValueTablePlannedDates.Columns.Add("Contract", New TypeDescription("CatalogRef.CounterpartyContracts"));
	ValueTablePlannedDates.Columns.Add("PlannedDate", New TypeDescription("Date", , , , New DateQualifiers(DateFractions.Date)));
	ValueTablePlannedDates.Columns.Add("SubscriptionPlan", New TypeDescription("CatalogRef.SubscriptionPlans"));
	ValueTablePlannedDates.Columns.Add("ActualDate", New TypeDescription("Date", , , , New DateQualifiers(DateFractions.Date)));
	
	StructurePlan = Common.ObjectAttributesValues(SubscriptionPlan, 
		"ChargeFrequency, ScheduledJobUUID, UseCustomSchedule");
	
	If Not StructurePlan.UseCustomSchedule Then
		
		DaysCounter = BegOfDay(StartDate);
		
		If StructurePlan.ChargeFrequency = Enums.Periodicity.Month Then
			
			DaysCounter = BegOfMonth(StartDate);
			
		ElsIf StructurePlan.ChargeFrequency = Enums.Periodicity.Year Then
			
			DaysCounter = BegOfYear(StartDate);
			
		EndIf;
		
		While DaysCounter <= EndDate Do
			
			If ScheduledJobs.FindByUUID(StructurePlan.ScheduledJobUUID).Schedule.ExecutionRequired(DaysCounter) Then
				
				If DaysCounter < StartDate 
					And StructurePlan.ChargeFrequency = Enums.Periodicity.Month Then
					
					DaysCounter = BegOfMonth(AddMonth(DaysCounter, 1));
					Continue;
					
				ElsIf DaysCounter < StartDate
					And StructurePlan.ChargeFrequency = Enums.Periodicity.Year Then
					
					DaysCounter = BegOfMonth(AddMonth(DaysCounter, 12));
					Continue;
					
				EndIf;
				
				NewLine = ValueTablePlannedDates.Add();
				
				NewLine.SubscriptionPlan	= SubscriptionPlan;
				NewLine.Counterparty		= Catalogs.Counterparties.EmptyRef();
				NewLine.Contract			= Catalogs.CounterpartyContracts.EmptyRef();
				NewLine.PlannedDate			= DaysCounter;
				NewLine.ActualDate			= Date(1, 1, 1);
				
				If StructurePlan.ChargeFrequency = Enums.Periodicity.Month Then
					
					DaysCounter = BegOfMonth(AddMonth(DaysCounter, 1));
					Continue;
					
				ElsIf StructurePlan.ChargeFrequency = Enums.Periodicity.Year Then
					
					DaysCounter = BegOfMonth(AddMonth(DaysCounter, 12));
					Continue;
					
				EndIf;
				
			EndIf; 
			
			DaysCounter = DaysCounter + 86400;
			
		EndDo;
		
	EndIf;

	If Not StructurePlan.UseCustomSchedule Then
		
		Query = New Query;
		Query.Text = 
		"SELECT ALLOWED
		|	ValueTablePlannedDates.PlannedDate AS PlannedDate,
		|	ValueTablePlannedDates.Counterparty AS Counterparty,
		|	ValueTablePlannedDates.Contract AS Contract,
		|	ValueTablePlannedDates.SubscriptionPlan AS SubscriptionPlan,
		|	ValueTablePlannedDates.ActualDate AS ActualDate
		|INTO TT_ValueTablePlannedDates
		|FROM
		|	&ValueTablePlannedDates AS ValueTablePlannedDates
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	GeneratedDocumentsData.SubscriptionPlan AS SubscriptionPlan,
		|	GeneratedDocumentsData.PlannedDate AS PlannedDate,
		|	GeneratedDocumentsData.ActualDate AS ActualDate,
		|	GeneratedDocumentsData.Counterparty AS Counterparty,
		|	GeneratedDocumentsData.Contract AS Contract
		|INTO TT_PrevGeneratedDocumentsData
		|FROM
		|	InformationRegister.GeneratedDocumentsData AS GeneratedDocumentsData
		|WHERE
		|	GeneratedDocumentsData.SubscriptionPlan = &SubscriptionPlan
		|	AND GeneratedDocumentsData.PlannedDate BETWEEN &BeginOfPeriod AND &EndOfPeriod
		|
		|UNION ALL
		|
		|SELECT
		|	TT_ValueTablePlannedDates.SubscriptionPlan,
		|	TT_ValueTablePlannedDates.PlannedDate,
		|	TT_ValueTablePlannedDates.ActualDate,
		|	Subscriptions.Counterparty,
		|	Subscriptions.Contract
		|FROM
		|	TT_ValueTablePlannedDates AS TT_ValueTablePlannedDates
		|		INNER JOIN InformationRegister.Subscriptions AS Subscriptions
		|		ON TT_ValueTablePlannedDates.SubscriptionPlan = Subscriptions.SubscriptionPlan
		|			AND (Subscriptions.StartDate <= TT_ValueTablePlannedDates.PlannedDate)
		|			AND (Subscriptions.EndDate >= TT_ValueTablePlannedDates.PlannedDate
		|				OR Subscriptions.EndDate = DATETIME(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	TT_PrevGeneratedDocumentsData.SubscriptionPlan AS SubscriptionPlan,
		|	TT_PrevGeneratedDocumentsData.PlannedDate AS PlannedDate,
		|	MAX(TT_PrevGeneratedDocumentsData.ActualDate) AS ActualDate,
		|	TT_PrevGeneratedDocumentsData.Counterparty AS Counterparty,
		|	TT_PrevGeneratedDocumentsData.Contract AS Contract,
		|	CASE
		|		WHEN MAX(TT_PrevGeneratedDocumentsData.ActualDate) = DATETIME(1, 1, 1)
		|			THEN 0
		|		ELSE DATEDIFF(TT_PrevGeneratedDocumentsData.PlannedDate, MAX(TT_PrevGeneratedDocumentsData.ActualDate), DAY)
		|	END AS DiffDates
		|FROM
		|	TT_PrevGeneratedDocumentsData AS TT_PrevGeneratedDocumentsData
		|
		|GROUP BY
		|	TT_PrevGeneratedDocumentsData.SubscriptionPlan,
		|	TT_PrevGeneratedDocumentsData.PlannedDate,
		|	TT_PrevGeneratedDocumentsData.Counterparty,
		|	TT_PrevGeneratedDocumentsData.Contract";
		
		Query.SetParameter("ValueTablePlannedDates", ValueTablePlannedDates);
		Query.SetParameter("SubscriptionPlan", SubscriptionPlan);
		Query.SetParameter("BeginOfPeriod", StartDate);
		Query.SetParameter("EndOfPeriod", EndDate);
		
		ValueTablePlannedDates = Query.Execute().Unload();
		
	Else 
	
		Query = New Query;
		Query.Text = 
		"SELECT ALLOWED
		|	GeneratedDocumentsData.SubscriptionPlan AS SubscriptionPlan,
		|	GeneratedDocumentsData.PlannedDate AS PlannedDate,
		|	DATETIME(1, 1, 1) AS ActualDate,
		|	VALUE(Catalog.Counterparties.EmptyRef) AS Counterparty,
		|	VALUE(Catalog.CounterpartyContracts.EmptyRef) AS Contract
		|INTO TT_ValueTablePlannedDates
		|FROM
		|	InformationRegister.GeneratedDocumentsData AS GeneratedDocumentsData
		|WHERE
		|	GeneratedDocumentsData.SubscriptionPlan = &SubscriptionPlan
		|	AND GeneratedDocumentsData.PlannedDate BETWEEN &BeginOfPeriod AND &EndOfPeriod
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	GeneratedDocumentsData.SubscriptionPlan AS SubscriptionPlan,
		|	GeneratedDocumentsData.PlannedDate AS PlannedDate,
		|	GeneratedDocumentsData.ActualDate AS ActualDate,
		|	GeneratedDocumentsData.Counterparty AS Counterparty,
		|	GeneratedDocumentsData.Contract AS Contract
		|INTO TT_PrevGeneratedDocumentsData
		|FROM
		|	InformationRegister.GeneratedDocumentsData AS GeneratedDocumentsData
		|WHERE
		|	GeneratedDocumentsData.SubscriptionPlan = &SubscriptionPlan
		|	AND GeneratedDocumentsData.PlannedDate BETWEEN &BeginOfPeriod AND &EndOfPeriod
		|	AND GeneratedDocumentsData.Counterparty <> VALUE(Catalog.Counterparties.EmptyRef)
		|	AND GeneratedDocumentsData.Contract <> VALUE(Catalog.CounterpartyContracts.EmptyRef)
		|
		|UNION ALL
		|
		|SELECT
		|	TT_ValueTablePlannedDates.SubscriptionPlan,
		|	TT_ValueTablePlannedDates.PlannedDate,
		|	TT_ValueTablePlannedDates.ActualDate,
		|	Subscriptions.Counterparty,
		|	Subscriptions.Contract
		|FROM
		|	TT_ValueTablePlannedDates AS TT_ValueTablePlannedDates
		|		INNER JOIN InformationRegister.Subscriptions AS Subscriptions
		|		ON TT_ValueTablePlannedDates.SubscriptionPlan = Subscriptions.SubscriptionPlan
		|			AND (Subscriptions.StartDate <= TT_ValueTablePlannedDates.PlannedDate)
		|			AND (Subscriptions.EndDate >= TT_ValueTablePlannedDates.PlannedDate
		|				OR Subscriptions.EndDate = DATETIME(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED
		|	TT_PrevGeneratedDocumentsData.SubscriptionPlan AS SubscriptionPlan,
		|	TT_PrevGeneratedDocumentsData.PlannedDate AS PlannedDate,
		|	MAX(TT_PrevGeneratedDocumentsData.ActualDate) AS ActualDate,
		|	TT_PrevGeneratedDocumentsData.Counterparty AS Counterparty,
		|	TT_PrevGeneratedDocumentsData.Contract AS Contract,
		|	CASE
		|		WHEN MAX(TT_PrevGeneratedDocumentsData.ActualDate) = DATETIME(1, 1, 1)
		|			THEN 0
		|		ELSE DATEDIFF(TT_PrevGeneratedDocumentsData.PlannedDate, MAX(TT_PrevGeneratedDocumentsData.ActualDate), DAY)
		|	END AS DiffDates
		|FROM
		|	TT_PrevGeneratedDocumentsData AS TT_PrevGeneratedDocumentsData
		|
		|GROUP BY
		|	TT_PrevGeneratedDocumentsData.SubscriptionPlan,
		|	TT_PrevGeneratedDocumentsData.PlannedDate,
		|	TT_PrevGeneratedDocumentsData.Counterparty,
		|	TT_PrevGeneratedDocumentsData.Contract";
		
		Query.SetParameter("SubscriptionPlan", SubscriptionPlan);
		Query.SetParameter("BeginOfPeriod", StartDate);
		Query.SetParameter("EndOfPeriod", EndDate);
		
		ValueTablePlannedDates = Query.Execute().Unload();
		
	EndIf;
	
	Return ValueTablePlannedDates;

EndFunction

#EndRegion

#EndIf
